markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_sysctl.h
/**
 * The following are defines for the bit fields in the SYSCTL_DC1 register.
 */
/*\{*/
#define SYSCTL_DC1_WDT1         0x10000000  ///< Watchdog Timer1 Present
#define SYSCTL_DC1_CAN2         0x04000000  ///< CAN Module 2 Present
#define SYSCTL_DC1_CAN1         0x02000000  ///< CAN Module 1 Present
#define SYSCTL_DC1_CAN0         0x01000000  ///< CAN Module 0 Present
#define SYSCTL_DC1_PWM          0x00100000  ///< PWM Module Present
#define SYSCTL_DC1_ADC1         0x00020000  ///< ADC Module 1 Present
#define SYSCTL_DC1_ADC0         0x00010000  ///< ADC Module 0 Present
#define SYSCTL_DC1_MINSYSDIV_M  0x0000F000  ///< System Clock Divider
#define SYSCTL_DC1_MINSYSDIV_100 \
                                0x00001000  ///< Divide VCO (400MHZ) by 5 minimum
#define SYSCTL_DC1_MINSYSDIV_66 0x00002000  ///< Divide VCO (400MHZ) by 2*2 + 2 =
                                            ///< 6 minimum
#define SYSCTL_DC1_MINSYSDIV_50 0x00003000  ///< Specifies a 50-MHz CPU clock
                                            ///< with a PLL divider of 4
#define SYSCTL_DC1_MINSYSDIV_25 0x00007000  ///< Specifies a 25-MHz clock with a
                                            ///< PLL divider of 8
#define SYSCTL_DC1_MINSYSDIV_20 0x00009000  ///< Specifies a 20-MHz clock with a
                                            ///< PLL divider of 10
#define SYSCTL_DC1_ADCSPD_M     0x00000F00  ///< Max ADC Speed
#define SYSCTL_DC1_ADCSPD_125K  0x00000000  ///< 125Ksps ADC
#define SYSCTL_DC1_ADCSPD_250K  0x00000100  ///< 250K samples/second
#define SYSCTL_DC1_ADCSPD_500K  0x00000200  ///< 500K samples/second
#define SYSCTL_DC1_ADCSPD_1M    0x00000300  ///< 1M samples/second
#define SYSCTL_DC1_ADC1SPD_M    0x00000C00  ///< Max ADC1 Speed
#define SYSCTL_DC1_ADC1SPD_1M   0x00000C00  ///< 1M samples/second
#define SYSCTL_DC1_ADC0SPD_M    0x00000300  ///< Max ADC0 Speed
#define SYSCTL_DC1_ADC0SPD_1M   0x00000300  ///< 1M samples/second
#define SYSCTL_DC1_MPU          0x00000080  ///< MPU Present
#define SYSCTL_DC1_HIB          0x00000040  ///< Hibernation Module Present
#define SYSCTL_DC1_TEMP         0x00000020  ///< Temp Sensor Present
#define SYSCTL_DC1_PLL          0x00000010  ///< PLL Present
#define SYSCTL_DC1_WDT0         0x00000008  ///< Watchdog Timer 0 Present
#define SYSCTL_DC1_SWO          0x00000004  ///< SWO Trace Port Present
#define SYSCTL_DC1_SWD          0x00000002  ///< SWD Present
#define SYSCTL_DC1_JTAG         0x00000001  ///< JTAG Present
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_DC2 register.
 */
/*\{*/
#define SYSCTL_DC2_EPI0         0x40000000  ///< EPI Module 0 Present
#define SYSCTL_DC2_I2S0         0x10000000  ///< I2S Module 0 Present
#define SYSCTL_DC2_COMP2        0x04000000  ///< Analog Comparator 2 Present
#define SYSCTL_DC2_COMP1        0x02000000  ///< Analog Comparator 1 Present
#define SYSCTL_DC2_COMP0        0x01000000  ///< Analog Comparator 0 Present
#define SYSCTL_DC2_TIMER3       0x00080000  ///< Timer Module 3 Present
#define SYSCTL_DC2_TIMER2       0x00040000  ///< Timer Module 2 Present
#define SYSCTL_DC2_TIMER1       0x00020000  ///< Timer Module 1 Present
#define SYSCTL_DC2_TIMER0       0x00010000  ///< Timer Module 0 Present
#define SYSCTL_DC2_I2C1         0x00004000  ///< I2C Module 1 Present
#define SYSCTL_DC2_I2C0         0x00001000  ///< I2C Module 0 Present
#define SYSCTL_DC2_QEI1         0x00000200  ///< QEI Module 1 Present
#define SYSCTL_DC2_QEI0         0x00000100  ///< QEI Module 0 Present
#define SYSCTL_DC2_SSI1         0x00000020  ///< SSI Module 1 Present
#define SYSCTL_DC2_SSI0         0x00000010  ///< SSI Module 0 Present
#define SYSCTL_DC2_UART2        0x00000004  ///< UART Module 2 Present
#define SYSCTL_DC2_UART1        0x00000002  ///< UART Module 1 Present
#define SYSCTL_DC2_UART0        0x00000001  ///< UART Module 0 Present
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_DC3 register.
 */
/*\{*/
#define SYSCTL_DC3_32KHZ        0x80000000  ///< 32KHz Input Clock Available
#define SYSCTL_DC3_CCP5         0x20000000  ///< CCP5 Pin Present
#define SYSCTL_DC3_CCP4         0x10000000  ///< CCP4 Pin Present
#define SYSCTL_DC3_CCP3         0x08000000  ///< CCP3 Pin Present
#define SYSCTL_DC3_CCP2         0x04000000  ///< CCP2 Pin Present
#define SYSCTL_DC3_CCP1         0x02000000  ///< CCP1 Pin Present
#define SYSCTL_DC3_CCP0         0x01000000  ///< CCP0 Pin Present
#define SYSCTL_DC3_ADC0AIN7     0x00800000  ///< ADC Module 0 AIN7 Pin Present
#define SYSCTL_DC3_ADC0AIN6     0x00400000  ///< ADC Module 0 AIN6 Pin Present
#define SYSCTL_DC3_ADC0AIN5     0x00200000  ///< ADC Module 0 AIN5 Pin Present
#define SYSCTL_DC3_ADC0AIN4     0x00100000  ///< ADC Module 0 AIN4 Pin Present
#define SYSCTL_DC3_ADC0AIN3     0x00080000  ///< ADC Module 0 AIN3 Pin Present
#define SYSCTL_DC3_ADC0AIN2     0x00040000  ///< ADC Module 0 AIN2 Pin Present
#define SYSCTL_DC3_ADC0AIN1     0x00020000  ///< ADC Module 0 AIN1 Pin Present
#define SYSCTL_DC3_ADC0AIN0     0x00010000  ///< ADC Module 0 AIN0 Pin Present
#define SYSCTL_DC3_PWMFAULT     0x00008000  ///< PWM Fault Pin Present
#define SYSCTL_DC3_C2O          0x00004000  ///< C2o Pin Present
#define SYSCTL_DC3_C2PLUS       0x00002000  ///< C2+ Pin Present
#define SYSCTL_DC3_C2MINUS      0x00001000  ///< C2- Pin Present
#define SYSCTL_DC3_C1O          0x00000800  ///< C1o Pin Present
#define SYSCTL_DC3_C1PLUS       0x00000400  ///< C1+ Pin Present
#define SYSCTL_DC3_C1MINUS      0x00000200  ///< C1- Pin Present
#define SYSCTL_DC3_C0O          0x00000100  ///< C0o Pin Present
#define SYSCTL_DC3_C0PLUS       0x00000080  ///< C0+ Pin Present
#define SYSCTL_DC3_C0MINUS      0x00000040  ///< C0- Pin Present
#define SYSCTL_DC3_PWM5         0x00000020  ///< PWM5 Pin Present
#define SYSCTL_DC3_PWM4         0x00000010  ///< PWM4 Pin Present
#define SYSCTL_DC3_PWM3         0x00000008  ///< PWM3 Pin Present
#define SYSCTL_DC3_PWM2         0x00000004  ///< PWM2 Pin Present
#define SYSCTL_DC3_PWM1         0x00000002  ///< PWM1 Pin Present
#define SYSCTL_DC3_PWM0         0x00000001  ///< PWM0 Pin Present
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_DC4 register.
 */
/*\{*/
#define SYSCTL_DC4_ETH          0x50000000  ///< Ethernet present
#define SYSCTL_DC4_EPHY0        0x40000000  ///< Ethernet PHY Layer 0 Present
#define SYSCTL_DC4_EMAC0        0x10000000  ///< Ethernet MAC Layer 0 Present
#define SYSCTL_DC4_E1588        0x01000000  ///< 1588 Capable
#define SYSCTL_DC4_PICAL        0x00040000  ///< PIOSC Calibrate
#define SYSCTL_DC4_CCP7         0x00008000  ///< CCP7 Pin Present
#define SYSCTL_DC4_CCP6         0x00004000  ///< CCP6 Pin Present
#define SYSCTL_DC4_UDMA         0x00002000  ///< Micro-DMA Module Present
#define SYSCTL_DC4_ROM          0x00001000  ///< Internal Code ROM Present
#define SYSCTL_DC4_GPIOJ        0x00000100  ///< GPIO Port J Present
#define SYSCTL_DC4_GPIOH        0x00000080  ///< GPIO Port H Present
#define SYSCTL_DC4_GPIOG        0x00000040  ///< GPIO Port G Present
#define SYSCTL_DC4_GPIOF        0x00000020  ///< GPIO Port F Present
#define SYSCTL_DC4_GPIOE        0x00000010  ///< GPIO Port E Present
#define SYSCTL_DC4_GPIOD        0x00000008  ///< GPIO Port D Present
#define SYSCTL_DC4_GPIOC        0x00000004  ///< GPIO Port C Present
#define SYSCTL_DC4_GPIOB        0x00000002  ///< GPIO Port B Present
#define SYSCTL_DC4_GPIOA        0x00000001  ///< GPIO Port A Present
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_DC5 register.
 */
/*\{*/
#define SYSCTL_DC5_PWMFAULT3    0x08000000  ///< PWM Fault 3 Pin Present
#define SYSCTL_DC5_PWMFAULT2    0x04000000  ///< PWM Fault 2 Pin Present
#define SYSCTL_DC5_PWMFAULT1    0x02000000  ///< PWM Fault 1 Pin Present
#define SYSCTL_DC5_PWMFAULT0    0x01000000  ///< PWM Fault 0 Pin Present
#define SYSCTL_DC5_PWMEFLT      0x00200000  ///< PWM Extended Fault Active
#define SYSCTL_DC5_PWMESYNC     0x00100000  ///< PWM Extended SYNC Active
#define SYSCTL_DC5_PWM7         0x00000080  ///< PWM7 Pin Present
#define SYSCTL_DC5_PWM6         0x00000040  ///< PWM6 Pin Present
#define SYSCTL_DC5_PWM5         0x00000020  ///< PWM5 Pin Present
#define SYSCTL_DC5_PWM4         0x00000010  ///< PWM4 Pin Present
#define SYSCTL_DC5_PWM3         0x00000008  ///< PWM3 Pin Present
#define SYSCTL_DC5_PWM2         0x00000004  ///< PWM2 Pin Present
#define SYSCTL_DC5_PWM1         0x00000002  ///< PWM1 Pin Present
#define SYSCTL_DC5_PWM0         0x00000001  ///< PWM0 Pin Present
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_DC6 register.
 */
/*\{*/
#define SYSCTL_DC6_USB0PHY      0x00000010  ///< USB Module 0 PHY Present
#define SYSCTL_DC6_USB0_M       0x00000003  ///< USB Module 0 Present
#define SYSCTL_DC6_USB0_DEV     0x00000001  ///< USB0 is Device Only
#define SYSCTL_DC6_USB0_HOSTDEV 0x00000002  ///< USB is Device or Host
#define SYSCTL_DC6_USB0_OTG     0x00000003  ///< USB0 is OTG
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_DC7 register.
 */
/*\{*/
#define SYSCTL_DC7_DMACH30      0x40000000  ///< SW
#define SYSCTL_DC7_DMACH29      0x20000000  ///< I2S0_TX / CAN1_TX
#define SYSCTL_DC7_DMACH28      0x10000000  ///< I2S0_RX / CAN1_RX
#define SYSCTL_DC7_DMACH27      0x08000000  ///< CAN1_TX / ADC1_SS3
#define SYSCTL_DC7_DMACH26      0x04000000  ///< CAN1_RX / ADC1_SS2
#define SYSCTL_DC7_DMACH25      0x02000000  ///< SSI1_TX / ADC1_SS1
#define SYSCTL_DC7_SSI1_TX      0x02000000  ///< SSI1 TX on uDMA Ch25
#define SYSCTL_DC7_SSI1_RX      0x01000000  ///< SSI1 RX on uDMA Ch24
#define SYSCTL_DC7_DMACH24      0x01000000  ///< SSI1_RX / ADC1_SS0
#define SYSCTL_DC7_UART1_TX     0x00800000  ///< UART1 TX on uDMA Ch23
#define SYSCTL_DC7_DMACH23      0x00800000  ///< UART1_TX / CAN2_TX
#define SYSCTL_DC7_DMACH22      0x00400000  ///< UART1_RX / CAN2_RX
#define SYSCTL_DC7_UART1_RX     0x00400000  ///< UART1 RX on uDMA Ch22
#define SYSCTL_DC7_DMACH21      0x00200000  ///< Timer1B / EPI0_WFIFO
#define SYSCTL_DC7_DMACH20      0x00100000  ///< Timer1A / EPI0_NBRFIFO
#define SYSCTL_DC7_DMACH19      0x00080000  ///< Timer0B / Timer1B
#define SYSCTL_DC7_DMACH18      0x00040000  ///< Timer0A / Timer1A
#define SYSCTL_DC7_DMACH17      0x00020000  ///< ADC0_SS3
#define SYSCTL_DC7_DMACH16      0x00010000  ///< ADC0_SS2
#define SYSCTL_DC7_DMACH15      0x00008000  ///< ADC0_SS1 / Timer2B
#define SYSCTL_DC7_DMACH14      0x00004000  ///< ADC0_SS0 / Timer2A
#define SYSCTL_DC7_DMACH13      0x00002000  ///< CAN0_TX / UART2_TX
#define SYSCTL_DC7_DMACH12      0x00001000  ///< CAN0_RX / UART2_RX
#define SYSCTL_DC7_SSI0_TX      0x00000800  ///< SSI0 TX on uDMA Ch11
#define SYSCTL_DC7_DMACH11      0x00000800  ///< SSI0_TX / SSI1_TX
#define SYSCTL_DC7_SSI0_RX      0x00000400  ///< SSI0 RX on uDMA Ch10
#define SYSCTL_DC7_DMACH10      0x00000400  ///< SSI0_RX / SSI1_RX
#define SYSCTL_DC7_UART0_TX     0x00000200  ///< UART0 TX on uDMA Ch9
#define SYSCTL_DC7_DMACH9       0x00000200  ///< UART0_TX / UART1_TX
#define SYSCTL_DC7_DMACH8       0x00000100  ///< UART0_RX / UART1_RX
#define SYSCTL_DC7_UART0_RX     0x00000100  ///< UART0 RX on uDMA Ch8
#define SYSCTL_DC7_DMACH7       0x00000080  ///< ETH_TX / Timer2B
#define SYSCTL_DC7_DMACH6       0x00000040  ///< ETH_RX / Timer2A
#define SYSCTL_DC7_DMACH5       0x00000020  ///< USB_EP3_TX / Timer2B
#define SYSCTL_DC7_USB_EP3_TX   0x00000020  ///< USB EP3 TX on uDMA Ch5
#define SYSCTL_DC7_USB_EP3_RX   0x00000010  ///< USB EP3 RX on uDMA Ch4
#define SYSCTL_DC7_DMACH4       0x00000010  ///< USB_EP3_RX / Timer2A
#define SYSCTL_DC7_USB_EP2_TX   0x00000008  ///< USB EP2 TX on uDMA Ch3
#define SYSCTL_DC7_DMACH3       0x00000008  ///< USB_EP2_TX / Timer3B
#define SYSCTL_DC7_USB_EP2_RX   0x00000004  ///< USB EP2 RX on uDMA Ch2
#define SYSCTL_DC7_DMACH2       0x00000004  ///< USB_EP2_RX / Timer3A
#define SYSCTL_DC7_USB_EP1_TX   0x00000002  ///< USB EP1 TX on uDMA Ch1
#define SYSCTL_DC7_DMACH1       0x00000002  ///< USB_EP1_TX / UART2_TX
#define SYSCTL_DC7_DMACH0       0x00000001  ///< USB_EP1_RX / UART2_RX
#define SYSCTL_DC7_USB_EP1_RX   0x00000001  ///< USB EP1 RX on uDMA Ch0
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_DC8 register.
 */
/*\{*/
#define SYSCTL_DC8_ADC1AIN15    0x80000000  ///< ADC Module 1 AIN15 Pin Present
#define SYSCTL_DC8_ADC1AIN14    0x40000000  ///< ADC Module 1 AIN14 Pin Present
#define SYSCTL_DC8_ADC1AIN13    0x20000000  ///< ADC Module 1 AIN13 Pin Present
#define SYSCTL_DC8_ADC1AIN12    0x10000000  ///< ADC Module 1 AIN12 Pin Present
#define SYSCTL_DC8_ADC1AIN11    0x08000000  ///< ADC Module 1 AIN11 Pin Present
#define SYSCTL_DC8_ADC1AIN10    0x04000000  ///< ADC Module 1 AIN10 Pin Present
#define SYSCTL_DC8_ADC1AIN9     0x02000000  ///< ADC Module 1 AIN9 Pin Present
#define SYSCTL_DC8_ADC1AIN8     0x01000000  ///< ADC Module 1 AIN8 Pin Present
#define SYSCTL_DC8_ADC1AIN7     0x00800000  ///< ADC Module 1 AIN7 Pin Present
#define SYSCTL_DC8_ADC1AIN6     0x00400000  ///< ADC Module 1 AIN6 Pin Present
#define SYSCTL_DC8_ADC1AIN5     0x00200000  ///< ADC Module 1 AIN5 Pin Present
#define SYSCTL_DC8_ADC1AIN4     0x00100000  ///< ADC Module 1 AIN4 Pin Present
#define SYSCTL_DC8_ADC1AIN3     0x00080000  ///< ADC Module 1 AIN3 Pin Present
#define SYSCTL_DC8_ADC1AIN2     0x00040000  ///< ADC Module 1 AIN2 Pin Present
#define SYSCTL_DC8_ADC1AIN1     0x00020000  ///< ADC Module 1 AIN1 Pin Present
#define SYSCTL_DC8_ADC1AIN0     0x00010000  ///< ADC Module 1 AIN0 Pin Present
#define SYSCTL_DC8_ADC0AIN15    0x00008000  ///< ADC Module 0 AIN15 Pin Present
#define SYSCTL_DC8_ADC0AIN14    0x00004000  ///< ADC Module 0 AIN14 Pin Present
#define SYSCTL_DC8_ADC0AIN13    0x00002000  ///< ADC Module 0 AIN13 Pin Present
#define SYSCTL_DC8_ADC0AIN12    0x00001000  ///< ADC Module 0 AIN12 Pin Present
#define SYSCTL_DC8_ADC0AIN11    0x00000800  ///< ADC Module 0 AIN11 Pin Present
#define SYSCTL_DC8_ADC0AIN10    0x00000400  ///< ADC Module 0 AIN10 Pin Present
#define SYSCTL_DC8_ADC0AIN9     0x00000200  ///< ADC Module 0 AIN9 Pin Present
#define SYSCTL_DC8_ADC0AIN8     0x00000100  ///< ADC Module 0 AIN8 Pin Present
#define SYSCTL_DC8_ADC0AIN7     0x00000080  ///< ADC Module 0 AIN7 Pin Present
#define SYSCTL_DC8_ADC0AIN6     0x00000040  ///< ADC Module 0 AIN6 Pin Present
#define SYSCTL_DC8_ADC0AIN5     0x00000020  ///< ADC Module 0 AIN5 Pin Present
#define SYSCTL_DC8_ADC0AIN4     0x00000010  ///< ADC Module 0 AIN4 Pin Present
#define SYSCTL_DC8_ADC0AIN3     0x00000008  ///< ADC Module 0 AIN3 Pin Present
#define SYSCTL_DC8_ADC0AIN2     0x00000004  ///< ADC Module 0 AIN2 Pin Present
#define SYSCTL_DC8_ADC0AIN1     0x00000002  ///< ADC Module 0 AIN1 Pin Present
#define SYSCTL_DC8_ADC0AIN0     0x00000001  ///< ADC Module 0 AIN0 Pin Present
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_PBORCTL register.
 */
/*\{*/
#define SYSCTL_PBORCTL_BORTIM_M 0x0000FFFC  ///< BOR Time Delay
#define SYSCTL_PBORCTL_BORIOR   0x00000002  ///< BOR Interrupt or Reset
#define SYSCTL_PBORCTL_BORWT    0x00000001  ///< BOR Wait and Check for Noise
#define SYSCTL_PBORCTL_BORTIM_S 2
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_LDOPCTL register.
 */
/*\{*/
#define SYSCTL_LDOPCTL_M        0x0000003F  ///< LDO Output Voltage
#define SYSCTL_LDOPCTL_2_50V    0x00000000  ///< 2.50
#define SYSCTL_LDOPCTL_2_45V    0x00000001  ///< 2.45
#define SYSCTL_LDOPCTL_2_40V    0x00000002  ///< 2.40
#define SYSCTL_LDOPCTL_2_35V    0x00000003  ///< 2.35
#define SYSCTL_LDOPCTL_2_30V    0x00000004  ///< 2.30
#define SYSCTL_LDOPCTL_2_25V    0x00000005  ///< 2.25
#define SYSCTL_LDOPCTL_2_75V    0x0000001B  ///< 2.75
#define SYSCTL_LDOPCTL_2_70V    0x0000001C  ///< 2.70
#define SYSCTL_LDOPCTL_2_65V    0x0000001D  ///< 2.65
#define SYSCTL_LDOPCTL_2_60V    0x0000001E  ///< 2.60
#define SYSCTL_LDOPCTL_2_55V    0x0000001F  ///< 2.55
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_SRCR0 register.
 */
/*\{*/
#define SYSCTL_SRCR0_WDT1       0x10000000  ///< WDT1 Reset Control
#define SYSCTL_SRCR0_CAN2       0x04000000  ///< CAN2 Reset Control
#define SYSCTL_SRCR0_CAN1       0x02000000  ///< CAN1 Reset Control
#define SYSCTL_SRCR0_CAN0       0x01000000  ///< CAN0 Reset Control
#define SYSCTL_SRCR0_PWM        0x00100000  ///< PWM Reset Control
#define SYSCTL_SRCR0_ADC1       0x00020000  ///< ADC1 Reset Control
#define SYSCTL_SRCR0_ADC0       0x00010000  ///< ADC0 Reset Control
#define SYSCTL_SRCR0_HIB        0x00000040  ///< HIB Reset Control
#define SYSCTL_SRCR0_WDT0       0x00000008  ///< WDT0 Reset Control
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_SRCR1 register.
 */
/*\{*/
#define SYSCTL_SRCR1_EPI0       0x40000000  ///< EPI0 Reset Control
#define SYSCTL_SRCR1_I2S0       0x10000000  ///< I2S0 Reset Control
#define SYSCTL_SRCR1_COMP2      0x04000000  ///< Analog Comp 2 Reset Control
#define SYSCTL_SRCR1_COMP1      0x02000000  ///< Analog Comp 1 Reset Control
#define SYSCTL_SRCR1_COMP0      0x01000000  ///< Analog Comp 0 Reset Control
#define SYSCTL_SRCR1_TIMER3     0x00080000  ///< Timer 3 Reset Control
#define SYSCTL_SRCR1_TIMER2     0x00040000  ///< Timer 2 Reset Control
#define SYSCTL_SRCR1_TIMER1     0x00020000  ///< Timer 1 Reset Control
#define SYSCTL_SRCR1_TIMER0     0x00010000  ///< Timer 0 Reset Control
#define SYSCTL_SRCR1_I2C1       0x00004000  ///< I2C1 Reset Control
#define SYSCTL_SRCR1_I2C0       0x00001000  ///< I2C0 Reset Control
#define SYSCTL_SRCR1_QEI1       0x00000200  ///< QEI1 Reset Control
#define SYSCTL_SRCR1_QEI0       0x00000100  ///< QEI0 Reset Control
#define SYSCTL_SRCR1_SSI1       0x00000020  ///< SSI1 Reset Control
#define SYSCTL_SRCR1_SSI0       0x00000010  ///< SSI0 Reset Control
#define SYSCTL_SRCR1_UART2      0x00000004  ///< UART2 Reset Control
#define SYSCTL_SRCR1_UART1      0x00000002  ///< UART1 Reset Control
#define SYSCTL_SRCR1_UART0      0x00000001  ///< UART0 Reset Control
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_SRCR2 register.
 */
/*\{*/
#define SYSCTL_SRCR2_EPHY0      0x40000000  ///< PHY0 Reset Control
#define SYSCTL_SRCR2_EMAC0      0x10000000  ///< MAC0 Reset Control
#define SYSCTL_SRCR2_USB0       0x00010000  ///< USB0 Reset Control
#define SYSCTL_SRCR2_UDMA       0x00002000  ///< Micro-DMA Reset Control
#define SYSCTL_SRCR2_GPIOJ      0x00000100  ///< Port J Reset Control
#define SYSCTL_SRCR2_GPIOH      0x00000080  ///< Port H Reset Control
#define SYSCTL_SRCR2_GPIOG      0x00000040  ///< Port G Reset Control
#define SYSCTL_SRCR2_GPIOF      0x00000020  ///< Port F Reset Control
#define SYSCTL_SRCR2_GPIOE      0x00000010  ///< Port E Reset Control
#define SYSCTL_SRCR2_GPIOD      0x00000008  ///< Port D Reset Control
#define SYSCTL_SRCR2_GPIOC      0x00000004  ///< Port C Reset Control
#define SYSCTL_SRCR2_GPIOB      0x00000002  ///< Port B Reset Control
#define SYSCTL_SRCR2_GPIOA      0x00000001  ///< Port A Reset Control
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_RIS register.
 */
/*\{*/
#define SYSCTL_RIS_MOSCPUPRIS   0x00000100  ///< MOSC Power Up Raw Interrupt
                                            ///< Status
#define SYSCTL_RIS_USBPLLLRIS   0x00000080  ///< USB PLL Lock Raw Interrupt
                                            ///< Status
#define SYSCTL_RIS_PLLLRIS      0x00000040  ///< PLL Lock Raw Interrupt Status
#define SYSCTL_RIS_CLRIS        0x00000020  ///< Current Limit Raw Interrupt
                                            ///< Status
#define SYSCTL_RIS_IOFRIS       0x00000010  ///< Internal Oscillator Fault Raw
                                            ///< Interrupt Status
#define SYSCTL_RIS_MOFRIS       0x00000008  ///< Main Oscillator Fault Raw
                                            ///< Interrupt Status
#define SYSCTL_RIS_LDORIS       0x00000004  ///< LDO Power Unregulated Raw
                                            ///< Interrupt Status
#define SYSCTL_RIS_BORRIS       0x00000002  ///< Brown-Out Reset Raw Interrupt
                                            ///< Status
#define SYSCTL_RIS_PLLFRIS      0x00000001  ///< PLL Fault Raw Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_IMC register.
 */
/*\{*/
#define SYSCTL_IMC_MOSCPUPIM    0x00000100  ///< MOSC Power Up Interrupt Mask
#define SYSCTL_IMC_USBPLLLIM    0x00000080  ///< USB PLL Lock Interrupt Mask
#define SYSCTL_IMC_PLLLIM       0x00000040  ///< PLL Lock Interrupt Mask
#define SYSCTL_IMC_CLIM         0x00000020  ///< Current Limit Interrupt Mask
#define SYSCTL_IMC_IOFIM        0x00000010  ///< Internal Oscillator Fault
                                            ///< Interrupt Mask
#define SYSCTL_IMC_MOFIM        0x00000008  ///< Main Oscillator Fault Interrupt
                                            ///< Mask
#define SYSCTL_IMC_LDOIM        0x00000004  ///< LDO Power Unregulated Interrupt
                                            ///< Mask
#define SYSCTL_IMC_BORIM        0x00000002  ///< Brown-Out Reset Interrupt Mask
#define SYSCTL_IMC_PLLFIM       0x00000001  ///< PLL Fault Interrupt Mask
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_MISC register.
 */
/*\{*/
#define SYSCTL_MISC_MOSCPUPMIS  0x00000100  ///< MOSC Power Up Masked Interrupt
                                            ///< Status
#define SYSCTL_MISC_USBPLLLMIS  0x00000080  ///< USB PLL Lock Masked Interrupt
                                            ///< Status
#define SYSCTL_MISC_PLLLMIS     0x00000040  ///< PLL Lock Masked Interrupt Status
#define SYSCTL_MISC_CLMIS       0x00000020  ///< Current Limit Masked Interrupt
                                            ///< Status
#define SYSCTL_MISC_IOFMIS      0x00000010  ///< Internal Oscillator Fault Masked
                                            ///< Interrupt Status
#define SYSCTL_MISC_MOFMIS      0x00000008  ///< Main Oscillator Fault Masked
                                            ///< Interrupt Status
#define SYSCTL_MISC_LDOMIS      0x00000004  ///< LDO Power Unregulated Masked
                                            ///< Interrupt Status
#define SYSCTL_MISC_BORMIS      0x00000002  ///< BOR Masked Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_RESC register.
 */
/*\{*/
#define SYSCTL_RESC_MOSCFAIL    0x00010000  ///< MOSC Failure Reset
#define SYSCTL_RESC_LDO         0x00000020  ///< LDO Reset
#define SYSCTL_RESC_WDT1        0x00000020  ///< Watchdog Timer 1 Reset
#define SYSCTL_RESC_SW          0x00000010  ///< Software Reset
#define SYSCTL_RESC_WDT0        0x00000008  ///< Watchdog Timer 0 Reset
#define SYSCTL_RESC_BOR         0x00000004  ///< Brown-Out Reset
#define SYSCTL_RESC_POR         0x00000002  ///< Power-On Reset
#define SYSCTL_RESC_EXT         0x00000001  ///< External Reset
/*\}*/

