markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_sysctl.h
/**
 * The following are defines for the bit fields in the SYSCTL_DCGC2 register.
 */
/*\{*/
#define SYSCTL_DCGC2_EPHY0      0x40000000  ///< PHY0 Clock Gating Control
#define SYSCTL_DCGC2_EMAC0      0x10000000  ///< MAC0 Clock Gating Control
#define SYSCTL_DCGC2_USB0       0x00010000  ///< USB0 Clock Gating Control
#define SYSCTL_DCGC2_UDMA       0x00002000  ///< Micro-DMA Clock Gating Control
#define SYSCTL_DCGC2_GPIOJ      0x00000100  ///< Port J Clock Gating Control
#define SYSCTL_DCGC2_GPIOH      0x00000080  ///< Port H Clock Gating Control
#define SYSCTL_DCGC2_GPIOG      0x00000040  ///< Port G Clock Gating Control
#define SYSCTL_DCGC2_GPIOF      0x00000020  ///< Port F Clock Gating Control
#define SYSCTL_DCGC2_GPIOE      0x00000010  ///< Port E Clock Gating Control
#define SYSCTL_DCGC2_GPIOD      0x00000008  ///< Port D Clock Gating Control
#define SYSCTL_DCGC2_GPIOC      0x00000004  ///< Port C Clock Gating Control
#define SYSCTL_DCGC2_GPIOB      0x00000002  ///< Port B Clock Gating Control
#define SYSCTL_DCGC2_GPIOA      0x00000001  ///< Port A Clock Gating Control
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_DSLPCLKCFG
 * register.
 */
/*\{*/
#define SYSCTL_DSLPCLKCFG_D_M   0x1F800000  ///< Divider Field Override
#define SYSCTL_DSLPCLKCFG_D_1   0x00000000  ///< System clock /1
#define SYSCTL_DSLPCLKCFG_D_2   0x00800000  ///< System clock /2
#define SYSCTL_DSLPCLKCFG_D_3   0x01000000  ///< System clock /3
#define SYSCTL_DSLPCLKCFG_D_4   0x01800000  ///< System clock /4
#define SYSCTL_DSLPCLKCFG_D_5   0x02000000  ///< System clock /5
#define SYSCTL_DSLPCLKCFG_D_6   0x02800000  ///< System clock /6
#define SYSCTL_DSLPCLKCFG_D_7   0x03000000  ///< System clock /7
#define SYSCTL_DSLPCLKCFG_D_8   0x03800000  ///< System clock /8
#define SYSCTL_DSLPCLKCFG_D_9   0x04000000  ///< System clock /9
#define SYSCTL_DSLPCLKCFG_D_10  0x04800000  ///< System clock /10
#define SYSCTL_DSLPCLKCFG_D_11  0x05000000  ///< System clock /11
#define SYSCTL_DSLPCLKCFG_D_12  0x05800000  ///< System clock /12
#define SYSCTL_DSLPCLKCFG_D_13  0x06000000  ///< System clock /13
#define SYSCTL_DSLPCLKCFG_D_14  0x06800000  ///< System clock /14
#define SYSCTL_DSLPCLKCFG_D_15  0x07000000  ///< System clock /15
#define SYSCTL_DSLPCLKCFG_D_16  0x07800000  ///< System clock /16
#define SYSCTL_DSLPCLKCFG_D_17  0x08000000  ///< System clock /17
#define SYSCTL_DSLPCLKCFG_D_18  0x08800000  ///< System clock /18
#define SYSCTL_DSLPCLKCFG_D_19  0x09000000  ///< System clock /19
#define SYSCTL_DSLPCLKCFG_D_20  0x09800000  ///< System clock /20
#define SYSCTL_DSLPCLKCFG_D_21  0x0A000000  ///< System clock /21
#define SYSCTL_DSLPCLKCFG_D_22  0x0A800000  ///< System clock /22
#define SYSCTL_DSLPCLKCFG_D_23  0x0B000000  ///< System clock /23
#define SYSCTL_DSLPCLKCFG_D_24  0x0B800000  ///< System clock /24
#define SYSCTL_DSLPCLKCFG_D_25  0x0C000000  ///< System clock /25
#define SYSCTL_DSLPCLKCFG_D_26  0x0C800000  ///< System clock /26
#define SYSCTL_DSLPCLKCFG_D_27  0x0D000000  ///< System clock /27
#define SYSCTL_DSLPCLKCFG_D_28  0x0D800000  ///< System clock /28
#define SYSCTL_DSLPCLKCFG_D_29  0x0E000000  ///< System clock /29
#define SYSCTL_DSLPCLKCFG_D_30  0x0E800000  ///< System clock /30
#define SYSCTL_DSLPCLKCFG_D_31  0x0F000000  ///< System clock /31
#define SYSCTL_DSLPCLKCFG_D_32  0x0F800000  ///< System clock /32
#define SYSCTL_DSLPCLKCFG_D_33  0x10000000  ///< System clock /33
#define SYSCTL_DSLPCLKCFG_D_34  0x10800000  ///< System clock /34
#define SYSCTL_DSLPCLKCFG_D_35  0x11000000  ///< System clock /35
#define SYSCTL_DSLPCLKCFG_D_36  0x11800000  ///< System clock /36
#define SYSCTL_DSLPCLKCFG_D_37  0x12000000  ///< System clock /37
#define SYSCTL_DSLPCLKCFG_D_38  0x12800000  ///< System clock /38
#define SYSCTL_DSLPCLKCFG_D_39  0x13000000  ///< System clock /39
#define SYSCTL_DSLPCLKCFG_D_40  0x13800000  ///< System clock /40
#define SYSCTL_DSLPCLKCFG_D_41  0x14000000  ///< System clock /41
#define SYSCTL_DSLPCLKCFG_D_42  0x14800000  ///< System clock /42
#define SYSCTL_DSLPCLKCFG_D_43  0x15000000  ///< System clock /43
#define SYSCTL_DSLPCLKCFG_D_44  0x15800000  ///< System clock /44
#define SYSCTL_DSLPCLKCFG_D_45  0x16000000  ///< System clock /45
#define SYSCTL_DSLPCLKCFG_D_46  0x16800000  ///< System clock /46
#define SYSCTL_DSLPCLKCFG_D_47  0x17000000  ///< System clock /47
#define SYSCTL_DSLPCLKCFG_D_48  0x17800000  ///< System clock /48
#define SYSCTL_DSLPCLKCFG_D_49  0x18000000  ///< System clock /49
#define SYSCTL_DSLPCLKCFG_D_50  0x18800000  ///< System clock /50
#define SYSCTL_DSLPCLKCFG_D_51  0x19000000  ///< System clock /51
#define SYSCTL_DSLPCLKCFG_D_52  0x19800000  ///< System clock /52
#define SYSCTL_DSLPCLKCFG_D_53  0x1A000000  ///< System clock /53
#define SYSCTL_DSLPCLKCFG_D_54  0x1A800000  ///< System clock /54
#define SYSCTL_DSLPCLKCFG_D_55  0x1B000000  ///< System clock /55
#define SYSCTL_DSLPCLKCFG_D_56  0x1B800000  ///< System clock /56
#define SYSCTL_DSLPCLKCFG_D_57  0x1C000000  ///< System clock /57
#define SYSCTL_DSLPCLKCFG_D_58  0x1C800000  ///< System clock /58
#define SYSCTL_DSLPCLKCFG_D_59  0x1D000000  ///< System clock /59
#define SYSCTL_DSLPCLKCFG_D_60  0x1D800000  ///< System clock /60
#define SYSCTL_DSLPCLKCFG_D_61  0x1E000000  ///< System clock /61
#define SYSCTL_DSLPCLKCFG_D_62  0x1E800000  ///< System clock /62
#define SYSCTL_DSLPCLKCFG_D_63  0x1F000000  ///< System clock /63
#define SYSCTL_DSLPCLKCFG_D_64  0x1F800000  ///< System clock /64
#define SYSCTL_DSLPCLKCFG_O_M   0x00000070  ///< Clock Source
#define SYSCTL_DSLPCLKCFG_O_IGN 0x00000000  ///< MOSC
#define SYSCTL_DSLPCLKCFG_O_IO  0x00000010  ///< PIOSC
#define SYSCTL_DSLPCLKCFG_O_30  0x00000030  ///< 30 kHz
#define SYSCTL_DSLPCLKCFG_O_32  0x00000070  ///< 32.768 kHz
#define SYSCTL_DSLPCLKCFG_IOSC  0x00000001  ///< IOSC Clock Source
#define SYSCTL_DSLPCLKCFG_D_S   23
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_CLKVCLR register.
 */
/*\{*/
#define SYSCTL_CLKVCLR_VERCLR   0x00000001  ///< Clock Verification Clear
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_PIOSCCAL
 * register.
 */
/*\{*/
#define SYSCTL_PIOSCCAL_UTEN    0x80000000  ///< Use User Trim Value
#define SYSCTL_PIOSCCAL_CAL     0x00000200  ///< Start Calibration
#define SYSCTL_PIOSCCAL_UPDATE  0x00000100  ///< Update Trim
#define SYSCTL_PIOSCCAL_UT_M    0x0000007F  ///< User Trim Value
#define SYSCTL_PIOSCCAL_UT_S    0
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_PIOSCSTAT
 * register.
 */
/*\{*/
#define SYSCTL_PIOSCSTAT_DT_M   0x007F0000  ///< Default Trim Value
#define SYSCTL_PIOSCSTAT_CR_M   0x00000300  ///< Calibration Result
#define SYSCTL_PIOSCSTAT_CRNONE 0x00000000  ///< Calibration has not been
                                            ///< attempted
#define SYSCTL_PIOSCSTAT_CRPASS 0x00000100  ///< The last calibration operation
                                            ///< completed to meet 1% accuracy
#define SYSCTL_PIOSCSTAT_CRFAIL 0x00000200  ///< The last calibration operation
                                            ///< failed to meet 1% accuracy
#define SYSCTL_PIOSCSTAT_CT_M   0x0000007F  ///< Calibration Trim Value
#define SYSCTL_PIOSCSTAT_DT_S   16
#define SYSCTL_PIOSCSTAT_CT_S   0
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_LDOARST register.
 */
/*\{*/
#define SYSCTL_LDOARST_LDOARST  0x00000001  ///< LDO Reset
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_I2SMCLKCFG
 * register.
 */
/*\{*/
#define SYSCTL_I2SMCLKCFG_RXEN  0x80000000  ///< RX Clock Enable
#define SYSCTL_I2SMCLKCFG_RXI_M 0x3FF00000  ///< RX Clock Integer Input
#define SYSCTL_I2SMCLKCFG_RXF_M 0x000F0000  ///< RX Clock Fractional Input
#define SYSCTL_I2SMCLKCFG_TXEN  0x00008000  ///< TX Clock Enable
#define SYSCTL_I2SMCLKCFG_TXI_M 0x00003FF0  ///< TX Clock Integer Input
#define SYSCTL_I2SMCLKCFG_TXF_M 0x0000000F  ///< TX Clock Fractional Input
#define SYSCTL_I2SMCLKCFG_RXI_S 20
#define SYSCTL_I2SMCLKCFG_RXF_S 16
#define SYSCTL_I2SMCLKCFG_TXI_S 4
#define SYSCTL_I2SMCLKCFG_TXF_S 0
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_DC9 register.
 */
/*\{*/
#define SYSCTL_DC9_ADC1DC7      0x00800000  ///< ADC1 DC7 Present
#define SYSCTL_DC9_ADC1DC6      0x00400000  ///< ADC1 DC6 Present
#define SYSCTL_DC9_ADC1DC5      0x00200000  ///< ADC1 DC5 Present
#define SYSCTL_DC9_ADC1DC4      0x00100000  ///< ADC1 DC4 Present
#define SYSCTL_DC9_ADC1DC3      0x00080000  ///< ADC1 DC3 Present
#define SYSCTL_DC9_ADC1DC2      0x00040000  ///< ADC1 DC2 Present
#define SYSCTL_DC9_ADC1DC1      0x00020000  ///< ADC1 DC1 Present
#define SYSCTL_DC9_ADC1DC0      0x00010000  ///< ADC1 DC0 Present
#define SYSCTL_DC9_ADC0DC7      0x00000080  ///< ADC0 DC7 Present
#define SYSCTL_DC9_ADC0DC6      0x00000040  ///< ADC0 DC6 Present
#define SYSCTL_DC9_ADC0DC5      0x00000020  ///< ADC0 DC5 Present
#define SYSCTL_DC9_ADC0DC4      0x00000010  ///< ADC0 DC4 Present
#define SYSCTL_DC9_ADC0DC3      0x00000008  ///< ADC0 DC3 Present
#define SYSCTL_DC9_ADC0DC2      0x00000004  ///< ADC0 DC2 Present
#define SYSCTL_DC9_ADC0DC1      0x00000002  ///< ADC0 DC1 Present
#define SYSCTL_DC9_ADC0DC0      0x00000001  ///< ADC0 DC0 Present
/*\}*/

/**
 * The following are defines for the bit fields in the SYSCTL_NVMSTAT register.
 */
/*\{*/
#define SYSCTL_NVMSTAT_TPSW     0x00000010  ///< Third Party Software Present
#define SYSCTL_NVMSTAT_FWB      0x00000001  ///< 32 Word Flash Write Buffer
                                            ///< Active
/*\}*/

/**
 * The following are deprecated defines for the System Control register
 * addresses.
 */
/*\{*/
#define SYSCTL_USER0            0x400FE1E0  ///< NV User Register 0
#define SYSCTL_USER1            0x400FE1E4  ///< NV User Register 1
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_DID0
 * register.
 */
/*\{*/
#define SYSCTL_DID0_VER_MASK    0x70000000  ///< DID0 version mask
#define SYSCTL_DID0_CLASS_MASK  0x00FF0000  ///< Device Class
#define SYSCTL_DID0_MAJ_MASK    0x0000FF00  ///< Major revision mask
#define SYSCTL_DID0_MAJ_A       0x00000000  ///< Major revision A
#define SYSCTL_DID0_MAJ_B       0x00000100  ///< Major revision B
#define SYSCTL_DID0_MAJ_C       0x00000200  ///< Major revision C
#define SYSCTL_DID0_MIN_MASK    0x000000FF  ///< Minor revision mask
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_DID1
 * register.
 */
/*\{*/
#define SYSCTL_DID1_VER_MASK    0xF0000000  ///< Register version mask
#define SYSCTL_DID1_FAM_MASK    0x0F000000  ///< Family mask
#define SYSCTL_DID1_FAM_S       0x00000000  ///< Stellaris family
#define SYSCTL_DID1_PRTNO_MASK  0x00FF0000  ///< Part number mask
#define SYSCTL_DID1_PINCNT_MASK 0x0000E000  ///< Pin count
#define SYSCTL_DID1_TEMP_MASK   0x000000E0  ///< Temperature range mask
#define SYSCTL_DID1_PKG_MASK    0x00000018  ///< Package mask
#define SYSCTL_DID1_PKG_48QFP   0x00000008  ///< QFP package
#define SYSCTL_DID1_QUAL_MASK   0x00000003  ///< Qualification status mask
#define SYSCTL_DID1_PKG_28SOIC  0x00000000  ///< SOIC package
#define SYSCTL_DID1_PRTNO_SHIFT 16
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_DC0
 * register.
 */
/*\{*/
#define SYSCTL_DC0_SRAMSZ_MASK  0xFFFF0000  ///< SRAM size mask
#define SYSCTL_DC0_FLASHSZ_MASK 0x0000FFFF  ///< Flash size mask
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_DC1
 * register.
 */
/*\{*/
#define SYSCTL_DC1_ADC          0x00010000  ///< ADC Module Present
#define SYSCTL_DC1_SYSDIV_MASK  0x0000F000  ///< Minimum system divider mask
#define SYSCTL_DC1_ADCSPD_MASK  0x00000F00  ///< ADC speed mask
#define SYSCTL_DC1_WDOG         0x00000008  ///< Watchdog present
#define SYSCTL_DC1_WDT          0x00000008  ///< Watchdog Timer Present
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_DC2
 * register.
 */
/*\{*/
#define SYSCTL_DC2_I2C          0x00001000  ///< I2C present
#define SYSCTL_DC2_QEI          0x00000100  ///< QEI present
#define SYSCTL_DC2_SSI          0x00000010  ///< SSI present
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_DC3
 * register.
 */
/*\{*/
#define SYSCTL_DC3_ADC7         0x00800000  ///< ADC7 Pin Present
#define SYSCTL_DC3_ADC6         0x00400000  ///< ADC6 Pin Present
#define SYSCTL_DC3_ADC5         0x00200000  ///< ADC5 Pin Present
#define SYSCTL_DC3_ADC4         0x00100000  ///< ADC4 Pin Present
#define SYSCTL_DC3_ADC3         0x00080000  ///< ADC3 Pin Present
#define SYSCTL_DC3_ADC2         0x00040000  ///< ADC2 Pin Present
#define SYSCTL_DC3_ADC1         0x00020000  ///< ADC1 Pin Present
#define SYSCTL_DC3_ADC0         0x00010000  ///< ADC0 Pin Present
#define SYSCTL_DC3_MC_FAULT0    0x00008000  ///< MC0 fault pin present
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the
 * SYSCTL_PBORCTL register.
 */
/*\{*/
#define SYSCTL_PBORCTL_BOR_MASK 0x0000FFFC  ///< BOR wait timer
#define SYSCTL_PBORCTL_BOR_SH   2
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the
 * SYSCTL_LDOPCTL register.
 */
/*\{*/
#define SYSCTL_LDOPCTL_MASK     0x0000003F  ///< Voltage adjust mask
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_SRCR0
 * register.
 */
/*\{*/
#define SYSCTL_SRCR0_ADC        0x00010000  ///< ADC0 Reset Control
#define SYSCTL_SRCR0_WDT        0x00000008  ///< WDT Reset Control
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_RESC
 * register.
 */
/*\{*/
#define SYSCTL_RESC_WDOG        0x00000008  ///< Watchdog reset
#define SYSCTL_RESC_WDT         0x00000008  ///< Watchdog Timer Reset
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_RCC
 * register.
 */
/*\{*/
#define SYSCTL_RCC_SYSDIV_MASK  0x07800000  ///< System clock divider
#define SYSCTL_RCC_USE_SYSDIV   0x00400000  ///< Use sytem clock divider
#define SYSCTL_RCC_USE_PWMDIV   0x00100000  ///< Use PWM clock divider
#define SYSCTL_RCC_PWMDIV_MASK  0x000E0000  ///< PWM clock divider
#define SYSCTL_RCC_OE           0x00001000  ///< PLL output enable
#define SYSCTL_RCC_XTAL_3_68MHz 0x00000140  ///< Using a 3.6864 MHz crystal
#define SYSCTL_RCC_XTAL_4MHz    0x00000180  ///< Using a 4 MHz crystal
#define SYSCTL_RCC_XTAL_MASK    0x000003C0  ///< Crystal attached to main osc
#define SYSCTL_RCC_OSCSRC_MASK  0x00000030  ///< Oscillator input select
#define SYSCTL_RCC_SYSDIV_SHIFT 23          ///< Shift to the SYSDIV field
#define SYSCTL_RCC_PWMDIV_SHIFT 17          ///< Shift to the PWMDIV field
#define SYSCTL_RCC_XTAL_SHIFT   6           ///< Shift to the XTAL field
#define SYSCTL_RCC_OSCSRC_SHIFT 4           ///< Shift to the OSCSRC field
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_PLLCFG
 * register.
 */
/*\{*/
#define SYSCTL_PLLCFG_OD_MASK   0x0000C000  ///< Output divider
#define SYSCTL_PLLCFG_F_MASK    0x00003FE0  ///< PLL multiplier
#define SYSCTL_PLLCFG_R_MASK    0x0000001F  ///< Input predivider
#define SYSCTL_PLLCFG_F_SHIFT   5
#define SYSCTL_PLLCFG_R_SHIFT   0
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_RCC2
 * register.
 */
/*\{*/
#define SYSCTL_RCC2_USEFRACT    0x40000000  ///< Use fractional divider
#define SYSCTL_RCC2_SYSDIV2_MSK 0x1F800000  ///< System clock divider
#define SYSCTL_RCC2_FRACT       0x00400000  ///< Fractional divide
#define SYSCTL_RCC2_OSCSRC2_MSK 0x00000070  ///< Oscillator input select
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_RCGC0
 * register.
 */
/*\{*/
#define SYSCTL_RCGC0_ADC        0x00010000  ///< ADC0 Clock Gating Control
#define SYSCTL_RCGC0_WDT        0x00000008  ///< WDT Clock Gating Control
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_SCGC0
 * register.
 */
/*\{*/
#define SYSCTL_SCGC0_ADC        0x00010000  ///< ADC0 Clock Gating Control
#define SYSCTL_SCGC0_WDT        0x00000008  ///< WDT Clock Gating Control
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_DCGC0
 * register.
 */
/*\{*/
#define SYSCTL_DCGC0_ADC        0x00010000  ///< ADC0 Clock Gating Control
#define SYSCTL_DCGC0_WDT        0x00000008  ///< WDT Clock Gating Control
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the
 * SYSCTL_DSLPCLKCFG register.
 */
/*\{*/
#define SYSCTL_DSLPCLKCFG_D_MSK 0x1F800000  ///< Deep sleep system clock override
#define SYSCTL_DSLPCLKCFG_O_MSK 0x00000070  ///< Deep sleep oscillator override
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the
 * SYSCTL_CLKVCLR register.
 */
/*\{*/
#define SYSCTL_CLKVCLR_CLR      0x00000001  ///< Clear clock verification fault
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the
 * SYSCTL_LDOARST register.
 */
/*\{*/
#define SYSCTL_LDOARST_ARST     0x00000001  ///< Allow LDO to reset device
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_SRCR0,
 * SYSCTL_RCGC0, SYSCTL_SCGC0, and SYSCTL_DCGC0 registers.
 */
/*\{*/
#define SYSCTL_SET0_CAN2        0x04000000  ///< CAN 2 module
#define SYSCTL_SET0_CAN1        0x02000000  ///< CAN 1 module
#define SYSCTL_SET0_CAN0        0x01000000  ///< CAN 0 module
#define SYSCTL_SET0_PWM         0x00100000  ///< PWM module
#define SYSCTL_SET0_ADC         0x00010000  ///< ADC module
#define SYSCTL_SET0_ADCSPD_MASK 0x00000F00  ///< ADC speed mask
#define SYSCTL_SET0_ADCSPD_125K 0x00000000  ///< 125Ksps ADC
#define SYSCTL_SET0_ADCSPD_250K 0x00000100  ///< 250Ksps ADC
#define SYSCTL_SET0_ADCSPD_500K 0x00000200  ///< 500Ksps ADC
#define SYSCTL_SET0_ADCSPD_1M   0x00000300  ///< 1Msps ADC
#define SYSCTL_SET0_HIB         0x00000040  ///< Hibernation module
#define SYSCTL_SET0_WDOG        0x00000008  ///< Watchdog module
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_SRCR1,
 * SYSCTL_RCGC1, SYSCTL_SCGC1, and SYSCTL_DCGC1 registers.
 */
/*\{*/
#define SYSCTL_SET1_COMP2       0x04000000  ///< Analog comparator module 2
#define SYSCTL_SET1_COMP1       0x02000000  ///< Analog comparator module 1
#define SYSCTL_SET1_COMP0       0x01000000  ///< Analog comparator module 0
#define SYSCTL_SET1_TIMER3      0x00080000  ///< Timer module 3
#define SYSCTL_SET1_TIMER2      0x00040000  ///< Timer module 2
#define SYSCTL_SET1_TIMER1      0x00020000  ///< Timer module 1
#define SYSCTL_SET1_TIMER0      0x00010000  ///< Timer module 0
#define SYSCTL_SET1_I2C1        0x00002000  ///< I2C module 1
#define SYSCTL_SET1_I2C0        0x00001000  ///< I2C module 0
#define SYSCTL_SET1_I2C         0x00001000  ///< I2C module
#define SYSCTL_SET1_QEI1        0x00000200  ///< QEI module 1
#define SYSCTL_SET1_QEI         0x00000100  ///< QEI module
#define SYSCTL_SET1_QEI0        0x00000100  ///< QEI module 0
#define SYSCTL_SET1_SSI1        0x00000020  ///< SSI module 1
#define SYSCTL_SET1_SSI0        0x00000010  ///< SSI module 0
#define SYSCTL_SET1_SSI         0x00000010  ///< SSI module
#define SYSCTL_SET1_UART2       0x00000004  ///< UART module 2
#define SYSCTL_SET1_UART1       0x00000002  ///< UART module 1
#define SYSCTL_SET1_UART0       0x00000001  ///< UART module 0
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_SRCR2,
 * SYSCTL_RCGC2, SYSCTL_SCGC2, and SYSCTL_DCGC2 registers.
 */
/*\{*/
#define SYSCTL_SET2_ETH         0x50000000  ///< ETH module
#define SYSCTL_SET2_GPIOH       0x00000080  ///< GPIO H module
#define SYSCTL_SET2_GPIOG       0x00000040  ///< GPIO G module
#define SYSCTL_SET2_GPIOF       0x00000020  ///< GPIO F module
#define SYSCTL_SET2_GPIOE       0x00000010  ///< GPIO E module
#define SYSCTL_SET2_GPIOD       0x00000008  ///< GPIO D module
#define SYSCTL_SET2_GPIOC       0x00000004  ///< GPIO C module
#define SYSCTL_SET2_GPIOB       0x00000002  ///< GPIO B module
#define SYSCTL_SET2_GPIOA       0x00000001  ///< GIPO A module
/*\}*/

/**
 * The following are deprecated defines for the bit fields in the SYSCTL_RIS,
 * SYSCTL_IMC, and SYSCTL_IMS registers.
 */
/*\{*/
#define SYSCTL_INT_PLL_LOCK     0x00000040  ///< PLL lock interrupt
#define SYSCTL_INT_CUR_LIMIT    0x00000020  ///< Current limit interrupt
#define SYSCTL_INT_IOSC_FAIL    0x00000010  ///< Internal oscillator failure int
#define SYSCTL_INT_MOSC_FAIL    0x00000008  ///< Main oscillator failure int
#define SYSCTL_INT_POR          0x00000004  ///< Power on reset interrupt
#define SYSCTL_INT_BOR          0x00000002  ///< Brown out interrupt
#define SYSCTL_INT_PLL_FAIL     0x00000001  ///< PLL failure interrupt
/*\}*/

#endif /* LM3S_SYSCTL_H */
